{"recordsCount":14,"blogRecords":[{"body":"Today I've finally brought myself to bootstraps. Figured out the basis and revised my blog's layout. It's all worth it. I'm totally exhausted to write something more. \r\n","title":"Start to bootstrap","date":1609072887094,"id":14,"likes":0,"dislikes":0,"comments":0},{"id":13,"body":"Just have finished the 'express' course on Hexlet. What I do want to say about it.. it is like a first chemistry class at the school when a teacher introduces the 'elements table', says 'this is Oxygen, that is Ferrum, that is Hydrogen, and this is Chlorum.'. And at the next lesson, that teacher gives you a task to make some methamphetamine. Need more theory and more practice. Stil no time for both. \r\n\r\n ","date":1608814914680,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":12,"body":"My 'one day - one post' challenge turned out to be much harder than expected. To be honest, despite I have a lot to tell about, once I sat down to write something, all my thoughts and ideas slip away. \r\nI guess if I wrote down just a part of things I was thinking the whole day about, this post would become a kind of long-read stuff, so I think I should try to run a draft during the day and summarise it in the evening, and that means that my blog requires another tool for drafting, something like a form that appears as soon as I'm authorised. Yes, somebody will say that I'm reinventing a bicycle, but I'm studying how to build bicycles, this is my \"bicycle\", \"there are many like it, but this one is mine\". //// I mark this post as IMPORTANT in the title in order to get back to it later. \r\n","date":1608730236362,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":11,"body":"Was struggling to force my self to do something useful these days, but it occurred to be impossible to write even a post to my blog. I don't know what is going on, I believe that I just need some rest. \r\n\r\nSome word about today. \r\nFirstly, I didn't get enough sleep last night and had to wake up early, so I felt like I was hit by a truck. \r\nSecondly, the is the 'end-of-the-year-is-coming' time, so all the office is in rush: we must finish a lot of tasks to finish the year as it should be.\r\nThirdly, the Spring Festival is coming too, and too many problems are usually connected to it. \r\nBesides, everyone around is nervous due to pandemic and despite how optimistic I am trying to stay, it costs me so much energy that I really want to slip away to an uninhabited island with my girlfriend and our cat. Of course, only for a second, because I believe such 'dark time' is a great opportunity to change something in my life. Surely, I have never been as much optimistic as I am right now, even though my future has never been so murky and uncirtain. \r\n","date":1608553173071,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":10,"body":"Today I've completed another server app for my blog on the express. It works, loads up templates and I hope I'll be able to move my blog to that server. I'm not sure although, but I'm going to try to launch pug for templating. My last try didn't succeed, I messed up my blog server and had to reload it from backups. I didn't understand, what went wrong, hope this new attempt will help. ","date":1608211811606,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":9,"body":"Hello, guys. Some shit happened, so I had to make a little gap in my blogging. I tried to revise my server code to launch it on express, but it took a lot of time to figure out how to manage it. I completed a part of a video course on node/express, and this will try to do my best to set all up and run the blog as I want and start working on the frontend part. Hope I will because I want to implement lots of features and implement both bootstraps and the React in my blog. Unfortunately, they both are almost unfamiliar to me. ","date":1608026400000,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":8,"body":"Today I've added the blog form into my front page, os it doesn't require to open the separate special page. Now it seems to be better but still doesn't work as good as I want. \r\nIn fact, it is a big problem for me to make the page \"as good\". Lack of experience is the reason. You can't know how something should look like if you don't know how it might look like: you don't know the rules of design, ergonomy or something. Of course, you've seen numerous pages and kinds of design, and you could imagine whatever you want - but how to realise it? How to implement? \"Trial and errors\" is the only way. Hope I will find a supervisor, who will help me to get improved. ","date":1607594400000,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":7,"body":"Today is my girlfriend's birthday, so I haven't managed to make a lot, just fixed some small bugs and revised the form design a little. Now it makes much easier to create new records: I don't need to entre the text directly into the server's code. Next step will be to integrate the form into the main page. ","date":1607508000000,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":6,"body":"I missed yesterday because failed with creating the adding records form. The most important lesson I learnt is: if something is going wrong, try again by FOLLOW THE MANUAL. I spen several hour to make my form sending POST requests and teaching my server to process that request in proper way. \r\nGlad to share a link that helped me a lot:\r\nhttps://itnext.io/how-to-handle-the-post-request-body-in-node-js-without-using-a-framework-cd2038b93190\r\n","date":1607421600000,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":5,"body":"Today I've made basic design for my blog-page so it can look like a real web page of something like that. I took huge time because it's my second attempt of layouting. Having no experience leaves my only \"trial-and-error\" approach","date":1607248800000,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":4,"body":"Plan for next days: add a form for adding new records","date":1607248800000,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":3,"body":"Hello everbody. This is my third blog record and I made it in order to test my adding-records-to-my-blog function. I spen my whole day to start my first own server for my personal page and blogging. I can't say it was easy. It is a situation when you have already learnt that everything muast be dame in proper way and you learnt something about proper way and you don't want to make it in a kind of \"let's do it in \"I'll rewise it later way\", but you don'n have a clue what is that \"proper way\" ","date":1607248800000,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":2,"body":"Secondly, last year I realised that I want to become a programmer. Someone may say that it’s a little bit late to change the profession and line of work in the middle of my thirties, but it’s better to try and ensure than hesitate or regret for a lifetime. I started my page and this blog from scratch without using any site-making services, templates or other stuff. I started to learn coding a year ago (2019) and this site (I’ll let myself call it my project) is my homework, diploma project and portfolio all in one. I hope it could help me to track my progress, to learn required techniques and introduce myself.","date":1607162400000,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":1,"body":"First of all, I need to apologise for my English, but it is one of my reasons. I live in non-English speaking country and don’t have opportunities and time to communicate to native speakers. I just can read and listen a lot, but not speak and write. Hope, it will help.","date":1607076000000,"title":"no title","likes":0,"dislikes":0,"comments":0},{"id":15,"date":1610111592217,"body":"When you are a newbie whatever you do everything is hard. You have some ideas and you are sure that all of them are implementable (at least you've seen someone else did something alike). At the same time, you don't have knowledge about how to realize them and you don't know what tool you can use and what are the most appropriate. You have to surf the web looking for the solution, but usually, the result is you \"reinvent a bicycle\" as you can't \"ride\" others'. \r\nIt's hard to accept that even a simple blog like this requires lots of technics... Does that mean that developing something big, real, useful is \"rocket science\"? Of course not, but everything is \"rocket science\" for me not. \r\n","title":"Confused and displeased","likes":0,"dislikes":0,"comments":0},{"id":16,"date":1610111975282,"body":"It seems that my cover page and blog are complete, at least version 1. And that is a stack: node.js, express, pug, bootstrap, jquery. Some small features are in progress, like styling, animation and so, but now I must get focused on my CV, projects page (especially the button page), time-line page, and move forward with Hexlet's study projects. ","title":"//// V1 of my cover page and blog complete","likes":0,"dislikes":0,"comments":0},{"id":17,"date":1610878751469,"body":"I haven't the power to say a lot, just tell you guys that my life is changing rapidly. I'm going to move to Moscow next month, and there are a lot of things to do. That's all for now because it seems that I still haven't realized that I'm really moving to another city. Tomorrow I'm going to tell my boss that I'm going to leave the company, and I'll try to post something every day even if I have nothing interesting, just as an exercise. Talking about exercises, I'm going to start exercising every morning. Don't know if it could help me.  ","title":"Moving to Moscow","likes":0,"dislikes":0,"comments":0},{"id":18,"date":1613532457532,"body":"Just to test if everything is going right and stable\r\n","title":"Test record. Long time haven't written","likes":0,"dislikes":0,"comments":0},{"id":19,"date":1613532820219,"body":"I'm in flight to Moscow right now. I'm feeling nothing but tired of packing things, and worrying about my girlfriend: she is going on this Saturday, and it may be a hard journey as she is not used to long distance travels, she has to get with out cat, and she is worry about everything right now as she is changing her live much heavier than me. \r\nHope I'll be able to keep posting something to my blog everyday: new thing a going to start happening. ","title":"On my way to Moscow","likes":0,"dislikes":0,"comments":0},{"id":20,"date":1613818594974,"body":"Today is my fourth day in Moscow. My girlfriend's arrived with our cat today, which means we are finally together. Both my girl and our cat are under stress, none of them understands what's happened, I'm still disoriented too. Obviously, we need some time to get used to this city and get used to the fact that it is a moment of starting our another life.  ","title":"4th day in Moscow","likes":0,"dislikes":0,"comments":0}]}